<?php
// PHP7/HTML5, EDGE/CHROME/YANDEX                       *** SockServer/index.php ***

// ****************************************************************************
// *                        --- Изучить работу с сокетами                     *
// ****************************************************************************

// v3.0.1, 20.01.2026                                 Автор:      Труфанов В.Е.
// Copyright © 2024 tve, sla6en9edged                 Дата создания: 08.10.2024

?>
<!DOCTYPE html>
<html>
<head>
    <meta charset="UTF-8" />
    <title>Трассировка сокет-сервера</title>
</head>
<body>
Трассировка сокет-сервера
</body>
</html>
<?php

// <!-- --> *********************************************** SockServer/index.php ***

