<?php

// PHP7/HTML5, EDGE/CHROME                                    *** index.php ***

// ****************************************************************************
// * probatv.ru                   ---Решение всяких-разных проблем для PHP5-PHP7 *
// ****************************************************************************

//                                                   Автор:       Труфанов В.Е.
//                                                   Дата создания:  12.12.2024
// Copyright © 2024 tve                              Посл.изменение: 12.12.2024

echo 'wsRusakov'.'<br>';

// ************************************************************** index.php ***
