<?php
// PHP7/HTML5, EDGE/CHROME/YANDEX                         *** j_getMems.php ***

// ****************************************************************************
// *                                     Выбрать и отправить данные по памяти *
// ****************************************************************************

// v1.0.0, 13.02.2026                                 Автор:      Труфанов В.Е.
// Copyright © 2025 tve                               Дата создания: 13.02.2026

$p1=memory_get_usage(false);
//prown\ConsoleLog('Память, занимаемая кодом PHP: '.$p1);
$p2=memory_get_usage(true);
//prown\ConsoleLog('Память, выделенная для сайта: '.$p2);
$p3=memory_get_peak_usage(false);
//prown\ConsoleLog('Пик потребления памяти:       '.$p3);
$p4=memory_get_peak_usage(true);
//prown\ConsoleLog('Пик выделения памяти сайту:   '.$p4);
// Возвращаем сообщение
$message='{"$p1":'.$p1.',"$p2":'.$p2.',"$p3":'.$p3.',"$p4":'.$p4.'}';
echo $message;
exit;

// ********************************************************** j_getMems.php ***
